//IPFS Phishing Campaign
//Sources: https://blog.talosintelligence.com/ipfs-abuse/, https://www.trendmicro.com/en_us/research/22/l/web3-ipfs-only-used-for-phishing---so-far.html,
           https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/ipfs-the-new-hotbed-of-phishing/
UrlClickEvents
| where Workload == 'Email'
| join kind=leftouter (EmailEvents | project NetworkMessageId, Subject, SenderFromAddress) on NetworkMessageId
| join kind=inner EmailUrlInfo on Url
| where UrlDomain has_any ("ipfs", "dweb") and Url has "baf"
| where EmailDirection == "Inbound" and DeliveryAction != "Blocked"
| where ActionType == "ClickAllowed"
| project SenderFromAddress, RecipientEmailAddress, Subject, Url, 
ActionType, IsClickedThrough, UrlDomain
